In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "Name":['kanaram', 'pintu','mukesh','chiku'],
    "Marks":[99,66,77,88],
    "City":['Jaipur','ajmer','kota','jodhpur'],
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

      Name  Marks     City
0  kanaram     99   Jaipur
1    pintu     66    ajmer
2   mukesh     77     kota
3    chiku     88  jodhpur

###### Create CSV file for result data

In [5]:
df.to_csv('student_details.csv')     #with index

In [6]:
df.to_csv('student_indexFalse.csv', index=False)    #index false

In [7]:
df.head(2)   #show first two row

      Name  Marks    City
0  kanaram     99  Jaipur
1    pintu     66   ajmer

In [8]:
df.tail(2)    #show last two row

     Name  Marks     City
2  mukesh     77     kota
3   chiku     88  jodhpur

In [9]:
df.describe()        #calculate min, max, mean, std,count, 75%, 50%, 25%

           Marks
count   4.000000
mean   82.500000
std    14.200939
min    66.000000
25%    74.250000
50%    82.500000
75%    90.750000
max    99.000000

In [11]:
Train = pd.read_csv('ram.csv')    #read CSV File

In [12]:
Train

   Train No  Train Speed From City To City
0    134234           99    Jaipur   ajmer
1    245223           66     ajmer  Jaipur
2      2525          107      kota  Jaipur
3     25252           88   jodhpur   ajmer
4     56363           99     ajmer    kota

In [14]:
Train['Train Speed'][0] = 110

<ipython-input-14-823ff74701f3>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Train['Train Speed'][0] = 110

In [15]:
Train

   Train No  Train Speed From City To City
0    134234          110    Jaipur   ajmer
1    245223           66     ajmer  Jaipur
2      2525          107      kota  Jaipur
3     25252           88   jodhpur   ajmer
4     56363           99     ajmer    kota

In [18]:
Train.to_csv('ram1.csv', index=False)

In [19]:
Train.index = ['TR1','TR2','TR3','TR4','TR5']    #change Index

In [20]:
Train

     Train No  Train Speed From City To City
TR1    134234          110    Jaipur   ajmer
TR2    245223           66     ajmer  Jaipur
TR3      2525          107      kota  Jaipur
TR4     25252           88   jodhpur   ajmer
TR5     56363           99     ajmer    kota